HandHeldLegend/ProCon-GCC-PIC18/ProConGCC.X/mcc_generated_files/pin_manager.h
// get/set X_IN aliases
#define X_IN_TRIS                 TRISAbits.TRISA6
#define X_IN_LAT                  LATAbits.LATA6
#define X_IN_PORT                 PORTAbits.RA6
#define X_IN_WPU                  WPUAbits.WPUA6
#define X_IN_OD                   ODCONAbits.ODCA6
#define X_IN_ANS                  ANSELAbits.ANSELA6
#define X_IN_SetHigh()            do { LATAbits.LATA6 = 1; } while(0)
#define X_IN_SetLow()             do { LATAbits.LATA6 = 0; } while(0)
#define X_IN_Toggle()             do { LATAbits.LATA6 = ~LATAbits.LATA6; } while(0)
#define X_IN_GetValue()           PORTAbits.RA6
#define X_IN_SetDigitalInput()    do { TRISAbits.TRISA6 = 1; } while(0)
#define X_IN_SetDigitalOutput()   do { TRISAbits.TRISA6 = 0; } while(0)
#define X_IN_SetPullup()          do { WPUAbits.WPUA6 = 1; } while(0)
#define X_IN_ResetPullup()        do { WPUAbits.WPUA6 = 0; } while(0)
#define X_IN_SetPushPull()        do { ODCONAbits.ODCA6 = 0; } while(0)
#define X_IN_SetOpenDrain()       do { ODCONAbits.ODCA6 = 1; } while(0)
#define X_IN_SetAnalogMode()      do { ANSELAbits.ANSELA6 = 1; } while(0)
#define X_IN_SetDigitalMode()     do { ANSELAbits.ANSELA6 = 0; } while(0)

// get/set B_IN aliases
#define B_IN_TRIS                 TRISAbits.TRISA7
#define B_IN_LAT                  LATAbits.LATA7
#define B_IN_PORT                 PORTAbits.RA7
#define B_IN_WPU                  WPUAbits.WPUA7
#define B_IN_OD                   ODCONAbits.ODCA7
#define B_IN_ANS                  ANSELAbits.ANSELA7
#define B_IN_SetHigh()            do { LATAbits.LATA7 = 1; } while(0)
#define B_IN_SetLow()             do { LATAbits.LATA7 = 0; } while(0)
#define B_IN_Toggle()             do { LATAbits.LATA7 = ~LATAbits.LATA7; } while(0)
#define B_IN_GetValue()           PORTAbits.RA7
#define B_IN_SetDigitalInput()    do { TRISAbits.TRISA7 = 1; } while(0)
#define B_IN_SetDigitalOutput()   do { TRISAbits.TRISA7 = 0; } while(0)
#define B_IN_SetPullup()          do { WPUAbits.WPUA7 = 1; } while(0)
#define B_IN_ResetPullup()        do { WPUAbits.WPUA7 = 0; } while(0)
#define B_IN_SetPushPull()        do { ODCONAbits.ODCA7 = 0; } while(0)
#define B_IN_SetOpenDrain()       do { ODCONAbits.ODCA7 = 1; } while(0)
#define B_IN_SetAnalogMode()      do { ANSELAbits.ANSELA7 = 1; } while(0)
#define B_IN_SetDigitalMode()     do { ANSELAbits.ANSELA7 = 0; } while(0)

// get/set DR_IN aliases
#define DR_IN_TRIS                 TRISBbits.TRISB0
#define DR_IN_LAT                  LATBbits.LATB0
#define DR_IN_PORT                 PORTBbits.RB0
#define DR_IN_WPU                  WPUBbits.WPUB0
#define DR_IN_OD                   ODCONBbits.ODCB0
#define DR_IN_ANS                  ANSELBbits.ANSELB0
#define DR_IN_SetHigh()            do { LATBbits.LATB0 = 1; } while(0)
#define DR_IN_SetLow()             do { LATBbits.LATB0 = 0; } while(0)
#define DR_IN_Toggle()             do { LATBbits.LATB0 = ~LATBbits.LATB0; } while(0)
#define DR_IN_GetValue()           PORTBbits.RB0
#define DR_IN_SetDigitalInput()    do { TRISBbits.TRISB0 = 1; } while(0)
#define DR_IN_SetDigitalOutput()   do { TRISBbits.TRISB0 = 0; } while(0)
#define DR_IN_SetPullup()          do { WPUBbits.WPUB0 = 1; } while(0)
#define DR_IN_ResetPullup()        do { WPUBbits.WPUB0 = 0; } while(0)
#define DR_IN_SetPushPull()        do { ODCONBbits.ODCB0 = 0; } while(0)
#define DR_IN_SetOpenDrain()       do { ODCONBbits.ODCB0 = 1; } while(0)
#define DR_IN_SetAnalogMode()      do { ANSELBbits.ANSELB0 = 1; } while(0)
#define DR_IN_SetDigitalMode()     do { ANSELBbits.ANSELB0 = 0; } while(0)

// get/set DL_IN aliases
#define DL_IN_TRIS                 TRISBbits.TRISB1
#define DL_IN_LAT                  LATBbits.LATB1
#define DL_IN_PORT                 PORTBbits.RB1
#define DL_IN_WPU                  WPUBbits.WPUB1
#define DL_IN_OD                   ODCONBbits.ODCB1
#define DL_IN_ANS                  ANSELBbits.ANSELB1
#define DL_IN_SetHigh()            do { LATBbits.LATB1 = 1; } while(0)
#define DL_IN_SetLow()             do { LATBbits.LATB1 = 0; } while(0)
#define DL_IN_Toggle()             do { LATBbits.LATB1 = ~LATBbits.LATB1; } while(0)
#define DL_IN_GetValue()           PORTBbits.RB1
#define DL_IN_SetDigitalInput()    do { TRISBbits.TRISB1 = 1; } while(0)
#define DL_IN_SetDigitalOutput()   do { TRISBbits.TRISB1 = 0; } while(0)
#define DL_IN_SetPullup()          do { WPUBbits.WPUB1 = 1; } while(0)
#define DL_IN_ResetPullup()        do { WPUBbits.WPUB1 = 0; } while(0)
#define DL_IN_SetPushPull()        do { ODCONBbits.ODCB1 = 0; } while(0)
#define DL_IN_SetOpenDrain()       do { ODCONBbits.ODCB1 = 1; } while(0)
#define DL_IN_SetAnalogMode()      do { ANSELBbits.ANSELB1 = 1; } while(0)
#define DL_IN_SetDigitalMode()     do { ANSELBbits.ANSELB1 = 0; } while(0)

// get/set GC_DATA aliases
#define GC_DATA_TRIS                 TRISBbits.TRISB2
#define GC_DATA_LAT                  LATBbits.LATB2
#define GC_DATA_PORT                 PORTBbits.RB2
#define GC_DATA_WPU                  WPUBbits.WPUB2
#define GC_DATA_OD                   ODCONBbits.ODCB2
#define GC_DATA_ANS                  ANSELBbits.ANSELB2
#define GC_DATA_SetHigh()            do { LATBbits.LATB2 = 1; } while(0)
#define GC_DATA_SetLow()             do { LATBbits.LATB2 = 0; } while(0)
#define GC_DATA_Toggle()             do { LATBbits.LATB2 = ~LATBbits.LATB2; } while(0)
#define GC_DATA_GetValue()           PORTBbits.RB2
#define GC_DATA_SetDigitalInput()    do { TRISBbits.TRISB2 = 1; } while(0)
#define GC_DATA_SetDigitalOutput()   do { TRISBbits.TRISB2 = 0; } while(0)
#define GC_DATA_SetPullup()          do { WPUBbits.WPUB2 = 1; } while(0)
#define GC_DATA_ResetPullup()        do { WPUBbits.WPUB2 = 0; } while(0)
#define GC_DATA_SetPushPull()        do { ODCONBbits.ODCB2 = 0; } while(0)
#define GC_DATA_SetOpenDrain()       do { ODCONBbits.ODCB2 = 1; } while(0)
#define GC_DATA_SetAnalogMode()      do { ANSELBbits.ANSELB2 = 1; } while(0)
#define GC_DATA_SetDigitalMode()     do { ANSELBbits.ANSELB2 = 0; } while(0)

// get/set RB3 procedures
#define RB3_SetHigh()            do { LATBbits.LATB3 = 1; } while(0)
#define RB3_SetLow()             do { LATBbits.LATB3 = 0; } while(0)
#define RB3_Toggle()             do { LATBbits.LATB3 = ~LATBbits.LATB3; } while(0)
#define RB3_GetValue()              PORTBbits.RB3
#define RB3_SetDigitalInput()    do { TRISBbits.TRISB3 = 1; } while(0)
#define RB3_SetDigitalOutput()   do { TRISBbits.TRISB3 = 0; } while(0)
#define RB3_SetPullup()             do { WPUBbits.WPUB3 = 1; } while(0)
#define RB3_ResetPullup()           do { WPUBbits.WPUB3 = 0; } while(0)
#define RB3_SetAnalogMode()         do { ANSELBbits.ANSELB3 = 1; } while(0)
#define RB3_SetDigitalMode()        do { ANSELBbits.ANSELB3 = 0; } while(0)

// get/set R_ENABLE aliases
#define R_ENABLE_TRIS                 TRISBbits.TRISB4
#define R_ENABLE_LAT                  LATBbits.LATB4
#define R_ENABLE_PORT                 PORTBbits.RB4
#define R_ENABLE_WPU                  WPUBbits.WPUB4
#define R_ENABLE_OD                   ODCONBbits.ODCB4
#define R_ENABLE_ANS                  ANSELBbits.ANSELB4
#define R_ENABLE_SetHigh()            do { LATBbits.LATB4 = 1; } while(0)
#define R_ENABLE_SetLow()             do { LATBbits.LATB4 = 0; } while(0)
#define R_ENABLE_Toggle()             do { LATBbits.LATB4 = ~LATBbits.LATB4; } while(0)
#define R_ENABLE_GetValue()           PORTBbits.RB4
#define R_ENABLE_SetDigitalInput()    do { TRISBbits.TRISB4 = 1; } while(0)
#define R_ENABLE_SetDigitalOutput()   do { TRISBbits.TRISB4 = 0; } while(0)
#define R_ENABLE_SetPullup()          do { WPUBbits.WPUB4 = 1; } while(0)
#define R_ENABLE_ResetPullup()        do { WPUBbits.WPUB4 = 0; } while(0)
#define R_ENABLE_SetPushPull()        do { ODCONBbits.ODCB4 = 0; } while(0)
#define R_ENABLE_SetOpenDrain()       do { ODCONBbits.ODCB4 = 1; } while(0)
#define R_ENABLE_SetAnalogMode()      do { ANSELBbits.ANSELB4 = 1; } while(0)
#define R_ENABLE_SetDigitalMode()     do { ANSELBbits.ANSELB4 = 0; } while(0)

