HandHeldLegend/ProCon-GCC-PIC18/ProConGCC.X/mcc_generated_files/pin_manager.h
// get/set ZL_IN aliases
#define ZL_IN_TRIS                 TRISBbits.TRISB5
#define ZL_IN_LAT                  LATBbits.LATB5
#define ZL_IN_PORT                 PORTBbits.RB5
#define ZL_IN_WPU                  WPUBbits.WPUB5
#define ZL_IN_OD                   ODCONBbits.ODCB5
#define ZL_IN_ANS                  ANSELBbits.ANSELB5
#define ZL_IN_SetHigh()            do { LATBbits.LATB5 = 1; } while(0)
#define ZL_IN_SetLow()             do { LATBbits.LATB5 = 0; } while(0)
#define ZL_IN_Toggle()             do { LATBbits.LATB5 = ~LATBbits.LATB5; } while(0)
#define ZL_IN_GetValue()           PORTBbits.RB5
#define ZL_IN_SetDigitalInput()    do { TRISBbits.TRISB5 = 1; } while(0)
#define ZL_IN_SetDigitalOutput()   do { TRISBbits.TRISB5 = 0; } while(0)
#define ZL_IN_SetPullup()          do { WPUBbits.WPUB5 = 1; } while(0)
#define ZL_IN_ResetPullup()        do { WPUBbits.WPUB5 = 0; } while(0)
#define ZL_IN_SetPushPull()        do { ODCONBbits.ODCB5 = 0; } while(0)
#define ZL_IN_SetOpenDrain()       do { ODCONBbits.ODCB5 = 1; } while(0)
#define ZL_IN_SetAnalogMode()      do { ANSELBbits.ANSELB5 = 1; } while(0)
#define ZL_IN_SetDigitalMode()     do { ANSELBbits.ANSELB5 = 0; } while(0)

// get/set Y_IN aliases
#define Y_IN_TRIS                 TRISCbits.TRISC0
#define Y_IN_LAT                  LATCbits.LATC0
#define Y_IN_PORT                 PORTCbits.RC0
#define Y_IN_WPU                  WPUCbits.WPUC0
#define Y_IN_OD                   ODCONCbits.ODCC0
#define Y_IN_ANS                  ANSELCbits.ANSELC0
#define Y_IN_SetHigh()            do { LATCbits.LATC0 = 1; } while(0)
#define Y_IN_SetLow()             do { LATCbits.LATC0 = 0; } while(0)
#define Y_IN_Toggle()             do { LATCbits.LATC0 = ~LATCbits.LATC0; } while(0)
#define Y_IN_GetValue()           PORTCbits.RC0
#define Y_IN_SetDigitalInput()    do { TRISCbits.TRISC0 = 1; } while(0)
#define Y_IN_SetDigitalOutput()   do { TRISCbits.TRISC0 = 0; } while(0)
#define Y_IN_SetPullup()          do { WPUCbits.WPUC0 = 1; } while(0)
#define Y_IN_ResetPullup()        do { WPUCbits.WPUC0 = 0; } while(0)
#define Y_IN_SetPushPull()        do { ODCONCbits.ODCC0 = 0; } while(0)
#define Y_IN_SetOpenDrain()       do { ODCONCbits.ODCC0 = 1; } while(0)
#define Y_IN_SetAnalogMode()      do { ANSELCbits.ANSELC0 = 1; } while(0)
#define Y_IN_SetDigitalMode()     do { ANSELCbits.ANSELC0 = 0; } while(0)

// get/set ZR_IN aliases
#define ZR_IN_TRIS                 TRISCbits.TRISC1
#define ZR_IN_LAT                  LATCbits.LATC1
#define ZR_IN_PORT                 PORTCbits.RC1
#define ZR_IN_WPU                  WPUCbits.WPUC1
#define ZR_IN_OD                   ODCONCbits.ODCC1
#define ZR_IN_ANS                  ANSELCbits.ANSELC1
#define ZR_IN_SetHigh()            do { LATCbits.LATC1 = 1; } while(0)
#define ZR_IN_SetLow()             do { LATCbits.LATC1 = 0; } while(0)
#define ZR_IN_Toggle()             do { LATCbits.LATC1 = ~LATCbits.LATC1; } while(0)
#define ZR_IN_GetValue()           PORTCbits.RC1
#define ZR_IN_SetDigitalInput()    do { TRISCbits.TRISC1 = 1; } while(0)
#define ZR_IN_SetDigitalOutput()   do { TRISCbits.TRISC1 = 0; } while(0)
#define ZR_IN_SetPullup()          do { WPUCbits.WPUC1 = 1; } while(0)
#define ZR_IN_ResetPullup()        do { WPUCbits.WPUC1 = 0; } while(0)
#define ZR_IN_SetPushPull()        do { ODCONCbits.ODCC1 = 0; } while(0)
#define ZR_IN_SetOpenDrain()       do { ODCONCbits.ODCC1 = 1; } while(0)
#define ZR_IN_SetAnalogMode()      do { ANSELCbits.ANSELC1 = 1; } while(0)
#define ZR_IN_SetDigitalMode()     do { ANSELCbits.ANSELC1 = 0; } while(0)

// get/set IO_RC2 aliases
#define IO_RC2_TRIS                 TRISCbits.TRISC2
#define IO_RC2_LAT                  LATCbits.LATC2
#define IO_RC2_PORT                 PORTCbits.RC2
#define IO_RC2_WPU                  WPUCbits.WPUC2
#define IO_RC2_OD                   ODCONCbits.ODCC2
#define IO_RC2_ANS                  ANSELCbits.ANSELC2
#define IO_RC2_SetHigh()            do { LATCbits.LATC2 = 1; } while(0)
#define IO_RC2_SetLow()             do { LATCbits.LATC2 = 0; } while(0)
#define IO_RC2_Toggle()             do { LATCbits.LATC2 = ~LATCbits.LATC2; } while(0)
#define IO_RC2_GetValue()           PORTCbits.RC2
#define IO_RC2_SetDigitalInput()    do { TRISCbits.TRISC2 = 1; } while(0)
#define IO_RC2_SetDigitalOutput()   do { TRISCbits.TRISC2 = 0; } while(0)
#define IO_RC2_SetPullup()          do { WPUCbits.WPUC2 = 1; } while(0)
#define IO_RC2_ResetPullup()        do { WPUCbits.WPUC2 = 0; } while(0)
#define IO_RC2_SetPushPull()        do { ODCONCbits.ODCC2 = 0; } while(0)
#define IO_RC2_SetOpenDrain()       do { ODCONCbits.ODCC2 = 1; } while(0)
#define IO_RC2_SetAnalogMode()      do { ANSELCbits.ANSELC2 = 1; } while(0)
#define IO_RC2_SetDigitalMode()     do { ANSELCbits.ANSELC2 = 0; } while(0)

// get/set START_IN aliases
#define START_IN_TRIS                 TRISCbits.TRISC3
#define START_IN_LAT                  LATCbits.LATC3
#define START_IN_PORT                 PORTCbits.RC3
#define START_IN_WPU                  WPUCbits.WPUC3
#define START_IN_OD                   ODCONCbits.ODCC3
#define START_IN_ANS                  ANSELCbits.ANSELC3
#define START_IN_SetHigh()            do { LATCbits.LATC3 = 1; } while(0)
#define START_IN_SetLow()             do { LATCbits.LATC3 = 0; } while(0)
#define START_IN_Toggle()             do { LATCbits.LATC3 = ~LATCbits.LATC3; } while(0)
#define START_IN_GetValue()           PORTCbits.RC3
#define START_IN_SetDigitalInput()    do { TRISCbits.TRISC3 = 1; } while(0)
#define START_IN_SetDigitalOutput()   do { TRISCbits.TRISC3 = 0; } while(0)
#define START_IN_SetPullup()          do { WPUCbits.WPUC3 = 1; } while(0)
#define START_IN_ResetPullup()        do { WPUCbits.WPUC3 = 0; } while(0)
#define START_IN_SetPushPull()        do { ODCONCbits.ODCC3 = 0; } while(0)
#define START_IN_SetOpenDrain()       do { ODCONCbits.ODCC3 = 1; } while(0)
#define START_IN_SetAnalogMode()      do { ANSELCbits.ANSELC3 = 1; } while(0)
#define START_IN_SetDigitalMode()     do { ANSELCbits.ANSELC3 = 0; } while(0)

// get/set R_IN aliases
#define R_IN_TRIS                 TRISCbits.TRISC4
#define R_IN_LAT                  LATCbits.LATC4
#define R_IN_PORT                 PORTCbits.RC4
#define R_IN_WPU                  WPUCbits.WPUC4
#define R_IN_OD                   ODCONCbits.ODCC4
#define R_IN_ANS                  ANSELCbits.ANSELC4
#define R_IN_SetHigh()            do { LATCbits.LATC4 = 1; } while(0)
#define R_IN_SetLow()             do { LATCbits.LATC4 = 0; } while(0)
#define R_IN_Toggle()             do { LATCbits.LATC4 = ~LATCbits.LATC4; } while(0)
#define R_IN_GetValue()           PORTCbits.RC4
#define R_IN_SetDigitalInput()    do { TRISCbits.TRISC4 = 1; } while(0)
#define R_IN_SetDigitalOutput()   do { TRISCbits.TRISC4 = 0; } while(0)
#define R_IN_SetPullup()          do { WPUCbits.WPUC4 = 1; } while(0)
#define R_IN_ResetPullup()        do { WPUCbits.WPUC4 = 0; } while(0)
#define R_IN_SetPushPull()        do { ODCONCbits.ODCC4 = 0; } while(0)
#define R_IN_SetOpenDrain()       do { ODCONCbits.ODCC4 = 1; } while(0)
#define R_IN_SetAnalogMode()      do { ANSELCbits.ANSELC4 = 1; } while(0)
#define R_IN_SetDigitalMode()     do { ANSELCbits.ANSELC4 = 0; } while(0)

// get/set L_IN aliases
#define L_IN_TRIS                 TRISCbits.TRISC5
#define L_IN_LAT                  LATCbits.LATC5
#define L_IN_PORT                 PORTCbits.RC5
#define L_IN_WPU                  WPUCbits.WPUC5
#define L_IN_OD                   ODCONCbits.ODCC5
#define L_IN_ANS                  ANSELCbits.ANSELC5
#define L_IN_SetHigh()            do { LATCbits.LATC5 = 1; } while(0)
#define L_IN_SetLow()             do { LATCbits.LATC5 = 0; } while(0)
#define L_IN_Toggle()             do { LATCbits.LATC5 = ~LATCbits.LATC5; } while(0)
#define L_IN_GetValue()           PORTCbits.RC5
#define L_IN_SetDigitalInput()    do { TRISCbits.TRISC5 = 1; } while(0)
#define L_IN_SetDigitalOutput()   do { TRISCbits.TRISC5 = 0; } while(0)
#define L_IN_SetPullup()          do { WPUCbits.WPUC5 = 1; } while(0)
#define L_IN_ResetPullup()        do { WPUCbits.WPUC5 = 0; } while(0)
#define L_IN_SetPushPull()        do { ODCONCbits.ODCC5 = 0; } while(0)
#define L_IN_SetOpenDrain()       do { ODCONCbits.ODCC5 = 1; } while(0)
#define L_IN_SetAnalogMode()      do { ANSELCbits.ANSELC5 = 1; } while(0)
#define L_IN_SetDigitalMode()     do { ANSELCbits.ANSELC5 = 0; } while(0)

// get/set DU_IN aliases
#define DU_IN_TRIS                 TRISCbits.TRISC6
#define DU_IN_LAT                  LATCbits.LATC6
#define DU_IN_PORT                 PORTCbits.RC6
#define DU_IN_WPU                  WPUCbits.WPUC6
#define DU_IN_OD                   ODCONCbits.ODCC6
#define DU_IN_ANS                  ANSELCbits.ANSELC6
#define DU_IN_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define DU_IN_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define DU_IN_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define DU_IN_GetValue()           PORTCbits.RC6
#define DU_IN_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define DU_IN_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define DU_IN_SetPullup()          do { WPUCbits.WPUC6 = 1; } while(0)
#define DU_IN_ResetPullup()        do { WPUCbits.WPUC6 = 0; } while(0)
#define DU_IN_SetPushPull()        do { ODCONCbits.ODCC6 = 0; } while(0)
#define DU_IN_SetOpenDrain()       do { ODCONCbits.ODCC6 = 1; } while(0)
#define DU_IN_SetAnalogMode()      do { ANSELCbits.ANSELC6 = 1; } while(0)
#define DU_IN_SetDigitalMode()     do { ANSELCbits.ANSELC6 = 0; } while(0)

