HandHeldLegend/ProCon-GCC-PIC18/ProConGCC.X/mcc_generated_files/pin_manager.h
// get/set DD_IN aliases
#define DD_IN_TRIS                 TRISCbits.TRISC7
#define DD_IN_LAT                  LATCbits.LATC7
#define DD_IN_PORT                 PORTCbits.RC7
#define DD_IN_WPU                  WPUCbits.WPUC7
#define DD_IN_OD                   ODCONCbits.ODCC7
#define DD_IN_ANS                  ANSELCbits.ANSELC7
#define DD_IN_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define DD_IN_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define DD_IN_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define DD_IN_GetValue()           PORTCbits.RC7
#define DD_IN_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define DD_IN_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define DD_IN_SetPullup()          do { WPUCbits.WPUC7 = 1; } while(0)
#define DD_IN_ResetPullup()        do { WPUCbits.WPUC7 = 0; } while(0)
#define DD_IN_SetPushPull()        do { ODCONCbits.ODCC7 = 0; } while(0)
#define DD_IN_SetOpenDrain()       do { ODCONCbits.ODCC7 = 1; } while(0)
#define DD_IN_SetAnalogMode()      do { ANSELCbits.ANSELC7 = 1; } while(0)
#define DD_IN_SetDigitalMode()     do { ANSELCbits.ANSELC7 = 0; } while(0)

/**
   @Param
    none
   @Returns
    none
   @Description
    GPIO and peripheral I/O initialization
   @Example
    PIN_MANAGER_Initialize();
 */
void PIN_MANAGER_Initialize (void);

/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handling routine
 * @Example
    PIN_MANAGER_IOC();
 */
void PIN_MANAGER_IOC(void);


/**
 * @Param
    none
 * @Returns
    none
 * @Description
    Interrupt on Change Handler for the IOCBF2 pin functionality
 * @Example
    IOCBF2_ISR();
 */
void IOCBF2_ISR(void);

/**
  @Summary
    Interrupt Handler Setter for IOCBF2 pin interrupt-on-change functionality

  @Description
    Allows selecting an interrupt handler for IOCBF2 at application runtime
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    InterruptHandler function pointer.

  @Example
    PIN_MANAGER_Initialize();
    IOCBF2_SetInterruptHandler(MyInterruptHandler);

*/
void IOCBF2_SetInterruptHandler(void (* InterruptHandler)(void));

/**
  @Summary
    Dynamic Interrupt Handler for IOCBF2 pin

  @Description
    This is a dynamic interrupt handler to be used together with the IOCBF2_SetInterruptHandler() method.
    This handler is called every time the IOCBF2 ISR is executed and allows any function to be registered at runtime.
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCBF2_SetInterruptHandler(IOCBF2_InterruptHandler);

*/
extern void (*IOCBF2_InterruptHandler)(void);

/**
  @Summary
    Default Interrupt Handler for IOCBF2 pin

  @Description
    This is a predefined interrupt handler to be used together with the IOCBF2_SetInterruptHandler() method.
    This handler is called every time the IOCBF2 ISR is executed. 
    
  @Preconditions
    Pin Manager intializer called

  @Returns
    None.

  @Param
    None.

  @Example
    PIN_MANAGER_Initialize();
    IOCBF2_SetInterruptHandler(IOCBF2_DefaultInterruptHandler);

*/
void IOCBF2_DefaultInterruptHandler(void);



#endif // PIN_MANAGER_H
/**
 End of File
*/